GUdaoxi/demo_qspi/LPTIM16_Timing/Drivers/FM33FH0xx_FL_Driver/Src/fm33fh0xx_fl_canfd.c
 /**    
  *******************************************************************************************************
  * @file    fm33fh0xx_fl_canfd.c
  * @author  FMSH Application Team
  * @brief   Source file of CANFD FL Module
  *******************************************************************************************************   
  * @attention    
  * Copyright 2024 SHANGHAI FUDAN MICROELECTRONICS GROUP CO., LTD.(FUDAN MICRO.)
  *        
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met: 
  *    
  * 1. Redistributions of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  *    
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  *    
  * 3. Neither the name of the copyright holder nor the names of its contributors 
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *    
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS “AS IS”
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE   
  * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
  * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
  * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT   
  * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
  * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.    
  *
  *******************************************************************************************************
  */    

/* Includes ------------------------------------------------------------------*/
#include "fm33fh0xx_fl.h"
/** @addtogroup FM33FH0XX_FL_Driver
  * @{
  */

/** @addtogroup CANFD
  * @{
  */

#ifdef FL_CANFD_DRIVER_ENABLED

/* Private macros ------------------------------------------------------------*/
/** @addtogroup CANFD_FL_Private_Macros
  * @{
  */


#define     IS_CANFD_INSTANCE(INSTANCE)                 ((INSTANCE) == CANFD)
                                                          
#define     IS_CANFD_GLOBAL_MODE(__VALUE__)             (((__VALUE__) == FL_CANFD_GLOBAL_MODE_OPERATION)    ||\
                                                          ((__VALUE__) == FL_CANFD_GLOBAL_MODE_RESET)       ||\
                                                          ((__VALUE__) == FL_CANFD_GLOBAL_MODE_HALT)        ||\
                                                          ((__VALUE__) == FL_CANFD_GLOBAL_MODE_KEEP_CURRENT))                                                         
                                                          
#define     IS_CANFD_CHANNEL_MODE(__VALUE__)            (((__VALUE__) == FL_CANFD_CHANNEL_MODE_OPERATION)  ||\
                                                          ((__VALUE__) == FL_CANFD_CHANNEL_MODE_RESET)      ||\
                                                          ((__VALUE__) == FL_CANFD_CHANNEL_MODE_HALT)       ||\
                                                          ((__VALUE__) == FL_CANFD_CHANNEL_MODE_KEEP_CURRENT))                                                          
                                                         
#define     IS_CANFD_NB_SJW(__VALUE__)                  ((__VALUE__) <= 0x7FU)
                                                         
#define     IS_CANFD_NB_TS1(__VALUE__)                  (((__VALUE__) > 0U) &&\
                                                          ((__VALUE__) <= 0xFFU))
                                                          
#define     IS_CANFD_NB_TS2(__VALUE__)                  (((__VALUE__) > 0U) &&\
                                                          ((__VALUE__) <= 0x7FU))

#define     IS_CANFD_DB_SJW(__VALUE__)                  ((__VALUE__) <= 0x0FU)
                                                         
#define     IS_CANFD_DB_TS1(__VALUE__)                  (((__VALUE__) > 0U) &&\
                                                          ((__VALUE__) <= 0x1FU))
                                                          
#define     IS_CANFD_DB_TS2(__VALUE__)                  (((__VALUE__) > 0) &&\
                                                          ((__VALUE__) <= 0x0FU))
                                                         
#define     IS_CANFD_CLOCK_SOURCE(__VALUE__)           (((__VALUE__) ==  FL_CMU_CANFD_CLK_SOURCE_APBCLK) ||\
                                                          ((__VALUE__) == FL_CMU_CANFD_CLK_SOURCE_XTHF)   ||\
                                                          ((__VALUE__) == FL_CMU_CANFD_CLK_SOURCE_PLL)    ||\
                                                          ((__VALUE__) == FL_CMU_CANFD_CLK_SOURCE_RCHF))   
                                                          
#define     IS_CANFD_CLOCK_SOURCE_RAM(__VALUE__)       (((__VALUE__) == FL_CMU_CANFDRAM_CLK_SOURCE_AHBCLK)  ||\
                                                          ((__VALUE__) ==FL_CMU_CANFDRAM_CLK_SOURCE_PLL   ))                                                        

#define     IS_CANFD_RXMB_PLS(__VALUE__)                (((__VALUE__) == FL_CANFD_RMPLS_SIZE_8)     ||\
                                                          ((__VALUE__) == FL_CANFD_RMPLS_SIZE_12)   ||\
                                                          ((__VALUE__) == FL_CANFD_RMPLS_SIZE_16)   ||\
                                                          ((__VALUE__) == FL_CANFD_RMPLS_SIZE_20)   ||\
                                                          ((__VALUE__) == FL_CANFD_RMPLS_SIZE_24)   ||\
                                                          ((__VALUE__) == FL_CANFD_RMPLS_SIZE_32)   ||\
                                                          ((__VALUE__) == FL_CANFD_RMPLS_SIZE_48)   ||\
                                                          ((__VALUE__) == FL_CANFD_RMPLS_SIZE_64))
                                                          
#define     IS_CANFD_RXMB_NUM(__VALUE__)                (((__VALUE__) <= 32U))                                                          
                                                          
#define     IS_CANFD_RXFIFO_IGCV(__VALUE__)             (((__VALUE__) == FL_CANFD_RFIGCV_1P8_FULL)  ||\
                                                          ((__VALUE__) == FL_CANFD_RFIGCV_1P4_FULL)   ||\
                                                          ((__VALUE__) == FL_CANFD_RFIGCV_3P8_FULL)   ||\
                                                          ((__VALUE__) == FL_CANFD_RFIGCV_1P2_FULL)   ||\
                                                          ((__VALUE__) == FL_CANFD_RFIGCV_5P8_FULL)   ||\
                                                          ((__VALUE__) == FL_CANFD_RFIGCV_3P4_FULL)   ||\
                                                          ((__VALUE__) == FL_CANFD_RFIGCV_7P8_FULL)   ||\
                                                          ((__VALUE__) == FL_CANFD_RFIGCV_FULL))

